Repository: MTK-ohtu/mtk-ohtu
Catalog: src/mtk_ohtu/translations/*/LC_MESSAGES/messages.po
Languages: fi, zh

source: buy
zh: 买

source: sell
zh: 卖

source: tn
zh: 吨

source: m3
zh: m³

source: kg
zh: 公斤

source: l
zh: 升

source: pcs
fi: kpl
zh: 件

source: batch
fi: erä
zh: 批

source: Manure
fi: Lanta
zh: 粪便

source: Grass, waste fodder and green growths
fi: Nurmi, hävikkirehu ja viherkasvustot
zh: 草、废弃饲料和植物

source: Basket fodder
fi: Korsirehut
zh: 篮子饲料

source: Plant-based biomasses
fi: Kasvipohjaiset biomassat
zh: 植物生物质

source: Animal-based biomasses
fi: Eläinperäiset biomassat
zh: 动物生物质

source: Soil and growing media
fi: Maa-aines ja kasvualustat
zh: 土壤和生长介质

source: Digestion
fi: Mädätteet
zh: 发酵

source: Wood
fi: Puu
zh: 木材

source: Other side streams (not biomass)
fi: Muut sivuvirrat (ei biomassa)
zh: 其他副流（非生物质）

source: Logistics and contracting
fi: Logistiikka ja urakointi
zh: 物流和承包商

source: Dry manure
fi: Kuivalanta
zh: 干粪

source: Sludge manure
fi: Lietelanta
zh: 污泥粪

source: Separated manure
fi: Separoitu lanta
zh: 分离的粪便

source: Other manure
fi: Muu lanta
zh: 其他粪便

source: Forest biomass
fi: Metsäbiomassa
zh: 森林生物质

source: Treated wood
fi: Käsitelty puu
zh: 经处理的木材

source: Electricity
fi: Sähkö
zh: 电力

source: Bio gas
fi: Biokaasu
zh: 沼气

source: Biodiesel
zh: 生物柴油

source: Hydrogen
fi: Vety
zh: 氢

source: Diesel
zh: 柴油

# error_occurred
source: An error occured. Please try again.
fi: Toiminto epäonnistui. Yritä uudelleen.
zh: 发生错误

source: Material type added
fi: Materiaalityyppi lisätty.
zh: 添加了材料类型

source: Material type removed
zh: 删除了材料类型

source: New location added
fi: Uusi toimipiste lisätty
zh: 添加了新地点

source: Changes saved!
fi: Muutokset tallennettu
zh: 保存了更改

source: Location removed
fi: Toimipaikka poistettu
zh: 删除了地点

source: submit_address_first
zh: 请先输入地址

source: km
zh: 公里

source: page_not_found
zh: 页面未找到

# add_logistics_title
source: Add a logistics service
fi: Lisää logistiikkapalvelu
zh: 添加物流服务

source: Select service type
fi: Palvelun tyyppi
zh: 选择服务类型

source: Private contractor
fi: Yksityisyrittäjä
zh: 私人承包商

source: Company
fi: Yritys
zh: 企业

source: Full name
fi: Koko nimi
zh: 全名

source: Company name
fi: Yrityksen nimi
zh: 企业名称

source: Business ID
fi: Y-tunnus
zh: 企业ＩＤ

source: Add location
fi: Lisää toimipiste
zh: 添加地点

source: Address
fi: Katuosoite
zh: 地址

source: Postal code
fi: Postinumero
zh: 邮政编码

source: City
fi: Kaupunki
zh: 城市

source: Phone number
fi: Puhelinnumero
zh: 电话号码

source: Email
fi: Sähköpostiosoite
zh: 电子邮件

source: Description
fi: Kuvaus
zh: 描述

# description_placeholder
source: Write description
fi: Kirjoita kuvaus
zh: 请描述您的服务

# how_far_can_you_deliver
source: How far are you able to deliver
fi: Kuinka pitkälle pystyt kuljettamaan
zh: 您能送到多远

source: No limit
fi: Ei rajoitusta
zh: 无限

source: Custom limit
fi: Mukautettu
zh: 自定义极限

source: Maximum distance
fi: Maksimietäisyys
zh: 最大距离

source: kilometers
fi: kilometriä
zh: 公里

# select_materials
source: Select materials you can deliver
fi: Valitse materiaalit joita pystyt kuljettamaan
zh: 选择材料

source: Additional information
fi: Lisätietoja
zh: 补充资料

source: Can spread
fi: Voin levittää
zh: 能传播

source: Base rate
fi: Pohjamaksu
zh: 基本费率

source: Price per hour
fi: Hinta per tunti
zh: 小时费率

source: Maximum capacity
fi: Maksimikapasiteetti
zh: 最大容量

source: Delivery distance
fi: Etäisyyden laskenta
zh: 输送距离

source: Same as above
fi: Sama kuin ylempänä
zh: 与上面相同

# material_delivery_description_placeholder
source: Write description
fi: Kirjoita kuvaus
zh: 添加补充资料

# add_logistics_submit
source: Submit logistics
fi: Lisää logistiikkapalvelu
zh: 提交

source: Close
fi: Sulje
zh: 关闭

# create_location
source: Add location
fi: Lisää toimipiste
zh: 建立地点

# ml_locations_header
source: Locations
fi: Toimipaikat
zh: 我的地点

# contractor_location_material_types
source: Material types you can deliver
fi: Materiaalityypit
zh: 地点的材料类型

# material_price
source: Price
fi: Hinta
zh: 材料价格

# max_capacity
source: Maximum capacity
fi: Maksimikapasiteetti
zh: 最大容量

source: Can process
fi: Levitysmahdollisuus
zh: 能加工

# title_subtext
source: Circular economy and logistics
fi: Kiertotalous ja logistiikka
zh: 循环经济与物流

source: Home
fi: Koti
zh: 首页

source: Listings
fi: Tuotteet
zh: 物品

source: distance_calculation_page
zh: 计算距离

source: My logistics
fi: Omat tiedot
zh: 我的物流

# add_logistics
source: Add a logistics service
fi: Lisää logistiikkapalvelu
zh: 添加物流服务

source: Log out
fi: Kirjaudu ulos
zh: 注销

source: Log in
fi: Kirjaudu sisään
zh: 登录

# footer_contact
source: Contact us
fi: Ota yhteyttä
zh: 联系我们

# footer_last_updated
source: Last updated
fi: Viimeksi päivitetty
zh: 最后更新

source: destination_address
zh: 目标地址

source: calculate_distance
zh: 计算距离

source: price
zh: 价格

source: Distance
fi: Kuljetussäde
zh: 距离

source: username
fi: Käyttäjätunnus
zh: 用户名

# input_username_error
source: username required or already taken
zh: 请输入用户名

source: password
fi: Salasana
zh: 密码

# forgot_password_question
source: Forgot password?
fi: Unohditko salasanasi
zh: 忘记了密码吗

source: input_password_error
fi: Väärä salasana
zh: 请输入密码

# dont_have_account_question
source: Dont have an account
fi: Eikö sinulla ole käyttäjää
zh: 没有帐户吗

# register_here_button
source: Register here
fi: Rekisteröidy tästä
zh: 登陆

source: Fuel economy
fi: Kulutus
zh: 燃料经济

source: Fuel
fi: Käyttövoima
zh: 燃料

source: Petrol
fi: Bensiini
zh: 汽油

source: Natural gas
fi: Maakaasu
zh: 天然气

source: fuel_efficiency
fi: Kulutus
zh: 燃料效率

source: show_all_button
zh: 显示所有

source: process_button
zh: 加工按钮

source: input_address_placeholder
zh: 请输入地址

source: register
fi: Rekisteröidy
zh: 登录

source: Email required or already taken
fi: Sähköposti tarvitaan tai se on otettu
zh: 电子邮件缺失或已被使用

source: Username required or already taken
fi: Käyttäjätunnus tarvitaan tai se on otettu
zh: 用户名缺失或已被使用

source: password_needs_to_have_one_number_and_one_special_character
zh: 密码需要至少一个数字和一个特殊字符

# select_eco_types
source: Select your ecological transport options
fi: Merkitse ekologiset kuljetusvaihtoehtosi

# add_new_location_header
source: Create new location
fi: Luo uusi toimipaikka

# dialog_confirm
source: Confirm
fi: Vahvista

# dialog_cancel
source: Cancel
fi: Peruuta

# remove_location_dialog_header
source: Confirm location deletion?
fi: Vahvista toimipaikan poisto?

# remove_material_dialog_header
source: Confirm material deletion?
fi: Vahvista materiaalin poisto?

# add_location_button
source: Create new location
fi: Uusi toimipaikka

# remove_location_button
source: delete location
fi: poista toimipiste

# remove_material_button
source: delete material type
fi: poista materiaalityyppi

# no_material_types_added_message
source: Nothing in here yet. Start by adding some materials.
fi: Ei lisättyjä materiaalityyppejä.

# no_locations_added_message
source: No locations. Start by creating a new location!
fi: Ei lisättyjä toimipaikkoja.

source: Services
fi: Palvelut
